"""Узнав, что ДНК не является случайной строкой, только что поступившие в Институт биоинформатики студентыгруппы информатиков предложили использовать алгоритм сжатия, который сжимает повторяющиеся символы в строке.Кодирование осуществляется следующим образом:s = 'aaaabbсaa' преобразуется в 'a4b2с1a2', то есть группы одинаковых символов исходной строки заменяются на этот символ и количество его повторений в этой позиции строки.Напишите программу, которая считывает строку, кодирует её предложенным алгоритмом и выводит закодированнуюпоследовательность на стандартный вывод. Кодирование должно учитывать регистр символов.Sample Input 1:aaaabbcaaSample Output 1:a4b2c1a2Sample Input 2:abcSample Output 2:a1b1c1"""A = input("")a = len(A) - 1n = 0j = 0i = 1e = 1while n != a:    if A[j] == A[i]:        e +=1        j +=1        i +=1        n +=1    else:        print(A[j], end="")        print(e, end="")        e = 1        j += 1        i += 1        n += 1print(A[j], end="")print(e, end="")